# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [ ]:
# import libraries here

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [ ]:
# your code here

#### Print `temp`.

In [ ]:
# your code here

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

#### Select the rows where state is New York.

In [ ]:
# your code here

#### What is the average temperature of cities in New York?

In [ ]:
# your code here

#### Which states and cities have a temperature above 15 degrees Celsius?

In [ ]:
# your code here

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [ ]:
# your code here

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [ ]:
# your code here

#### Find the mean and standard deviation of the temperature of each state.

In [ ]:
# your code here

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [1]:
# your code here
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

#### Explore the data types of the `employees` dataframe. Comment your results.

In [6]:
# your code here
employees = pd.read_csv('Employee.csv')

print(employees.shape)
print(employees.head(10))
print(employees.dtypes)

(9, 7)
     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70
Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [ ]:
"""
Looks pretty good to be honest. Potentially we could one hot encode gender just to binary - potentially the other columns as well but it would
create a large dataframe. I'm not sure if that should be a concern. Otherwise it looks good to be, no null values, doesn't require any cleaning

"""

#### What's the average salary in this company?

In [7]:
# your code here
employees['Salary'].mean()

48.888888888888886

#### What's the highest salary?

In [ ]:
# your code here
employees['Salary'].max()

#### What's the lowest salary?

In [10]:
# your code here
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [21]:
# your code here
employess_sorted = employees.sort_values(by='Salary')

display(employess_sorted.head(5))
# Maria and David

# We could also:
employees_30 = employees[employees['Salary'] == 30]

display(employees_30)

     Name Department Education Gender      Title  Years  Salary
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
0    Jose         IT  Bachelor      M    analyst      1      35
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [18]:
# your code here
David_index = employees[employees['Name'] == 'David'].index[0]
print(employees.loc[David_index])

Name            David
Department         HR
Education      Master
Gender              M
Title         analyst
Years               2
Salary             30
Name: 2, dtype: object

#### Could you return only David's salary?

In [20]:
# your code here
print(employees.loc[David_index, 'Salary'])

30

#### Print all the rows where job title is associate.

In [22]:
# your code here
associates = employees[employees['Title'] == 'associate']

print(associates)

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [23]:
# Method 1
# your code here
print(employees.head(3))

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [24]:
# Method 2
# your code here
print(employees.loc[:2])

#I could also use .iloc[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [28]:
# your code here
associates_55 = employees[(employees['Title'] == 'associate') & (employees['Salary'] > 55)]

print(associates_55)

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [29]:
# your code here
average_salaries_py = employees.groupby('Years')['Salary'].mean()
display(average_salaries_py)

Years
1    35.000000
2    38.333333
3    55.000000
4    35.000000
7    60.000000
8    70.000000
Name: Salary, dtype: float64

####  What is the average salary per title?

In [31]:
# your code here
average_salaries_pt = employees.groupby('Title')['Salary'].mean()
display(average_salaries_pt)

Title
VP           70.000000
analyst      32.500000
associate    56.666667
Name: Salary, dtype: float64

####  Find the salary quartiles.

In [35]:
# your code here
employees['Salary_Quartile'] = pd.qcut(employees['Salary'], 4, labels=['Q1', 'Q2', 'Q3', 'Q4'])

,Name,Department,Education,Gender,Title,Years,Salary,Salary_Quartile
0,Jose,IT,Bachelor,M,analyst,1,35,Q1
1,Maria,IT,Master,F,analyst,2,30,Q1
2,David,HR,Master,M,analyst,2,30,Q1
3,Sonia,HR,Bachelor,F,analyst,4,35,Q1
4,Samuel,Sales,Master,M,associate,3,55,Q2
5,Eva,Sales,Bachelor,F,associate,2,55,Q2
6,Carlos,IT,Master,M,VP,8,70,Q4
7,Pedro,IT,Phd,M,associate,7,60,Q3
8,Ana,HR,Master,F,VP,8,70,Q4

#### Is the mean salary different per gender?

In [37]:
# your code here
employees.groupby('Gender')['Salary'].mean()

#yes, 2.5 lower for females

Gender
F    47.5
M    50.0
Name: Salary, dtype: float64

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [40]:
# your code here
# This is just years and salary
display(employees.groupby('Department')['Salary'].mean())
display(employees.groupby('Department')['Salary'].max())
display(employees.groupby('Department')['Salary'].min())

display(employees.groupby('Department')['Years'].mean())
display(employees.groupby('Department')['Years'].max())
display(employees.groupby('Department')['Years'].min())

Department
HR       45.00
IT       48.75
Sales    55.00
Name: Salary, dtype: float64

Department
HR       70
IT       70
Sales    55
Name: Salary, dtype: int64

Department
HR       30
IT       30
Sales    55
Name: Salary, dtype: int64

Department
HR       4.666667
IT       4.500000
Sales    2.500000
Name: Years, dtype: float64

Department
HR       8
IT       8
Sales    3
Name: Years, dtype: int64

Department
HR       2
IT       1
Sales    2
Name: Years, dtype: int64

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [44]:
# your code here
# This was tricky, had to search quite a bit

employees.groupby('Department')['Salary'].agg(lambda x: x.max() - x.min())

#This is cool though, so I could do this as well:

employees.groupby('Department').agg({
    'Salary': lambda x: x.max() - x.min(),
    'Years': lambda x: x.mean()
})

#Thats handy!

            Salary     Years
Department
HR              40  4.666667
IT              40  4.500000
Sales            0  2.500000

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here